#+title: Readme
* Star
Star is the management tool to manage operations and configure the starintel project

Star also lets you interact with the starRouter message queue.
** Notice
The starRouter has been deprecated in favor of star-server.
Stuff like "init" will be removed as star-server now handles that.


** Installation
#+begin_src shell
git clone https://github.com/lost-rob0t/star-cli.git star/ && cd star
nimble install
#+end_src

*** Configuration file
after you have installed ~star~ edit the file "config.ini" and put the file in ~~/.config/starintel/config.ini~

** Usage
Get help
#+begin_src sh :results output replace
./star --help
#+end_src

#+RESULTS:
#+begin_example
Usage:
  star {SUBCMD}  [sub-command options & parameters]
where {SUBCMD} is one of:
  help              print comprehensive or per-cmd help
  target
  init
  insert_data
  publishDocuments
  subscribe

star {-h|--help} or with no args at all prints this message.
star --help-syntax gives general cligen syntax help.
Run "star {help SUBCMD|SUBCMD --help}" to see help for just SUBCMD.
Run "star help" to get *comprehensive* help.
#+end_example

#+begin_src sh :results output replace
star <subCommand> --help
#+end_src

*** Init database
DEPRECATED
#+begin_src shell
star init
#+end_src

*** Create target json
Targets are a document that holds configuration for automations

To create a new target

#+begin_src shell
star target -a <bot name> -t <bot input> -o <extra json options if needed>
#+end_src
